lizhiok/FPInterro/Libraries/MDK_LIB/RL/FlashFS/Drivers/NAND_STM32F2xx.c
/*-----------------------------------------------------------------------------
 *      RL-ARM - FlashFS
 *-----------------------------------------------------------------------------
 *      Name:    NAND_STM32F2xx.c
 *      Purpose: NAND Flash Driver for ST STM32F2xx
 *      Rev.:    V4.72
 *-----------------------------------------------------------------------------
 *      This code is part of the RealView Run-Time Library.
 *      Copyright (c) 2004-2013 KEIL - An ARM Company. All rights reserved.
 *----------------------------------------------------------------------------*/

#include <File_Config.h>
#include <stm32f2xx.h>                  /* STM32F2xxx Definitions             */
#include "NAND_STM32F2xx.h"


/* #define FSMC_BANK1_CS1 */            /* OneNAND Driver Template */
#define FSMC_BANK3                      /* NAND Driver Template    */

/*-----------------------------------------------------------------------------
 *      NAND driver prototypes
 *----------------------------------------------------------------------------*/
static U32 Init         (NAND_DRV_CFG *cfg);
static U32 UnInit       (NAND_DRV_CFG *cfg);
static U32 PageRead     (U32 row, U8 *buf, NAND_DRV_CFG *cfg);
static U32 PageWrite    (U32 row, U8 *buf, NAND_DRV_CFG *cfg);
static U32 BlockErase   (U32 row, NAND_DRV_CFG *cfg);

/*-----------------------------------------------------------------------------
  NAND Device Driver Control Block
 *----------------------------------------------------------------------------*/
const NAND_DRV nand0_drv = {
  Init,
  UnInit,
  PageRead,
  PageWrite,
  BlockErase,
};


/*-----------------------------------------------------------------------------
 *      Initialise Flexible Static Memory Controler (FSMC)
 * Configure: - Data Lines    [D0 ÷ D16]
 *            - Address Lines [A0 ÷ A17]
 *            - Signal Lines NWE/NOE/CLK/NL/NWAIT
 *
 * cs = FSMC Chip Select (NOR/PSRAM, NAND, PC Card chip select)
 *
 *  Return: RTV_NOERR - Init successful
 *----------------------------------------------------------------------------*/
U32 FSMC_Init (U32 cs) {

  /* Enable system configuration controller clock */
  RCC->APB2ENR |= 1 << 14;

  /* Enable FSMC clock */
  RCC->AHB3ENR |= 1;

  /* Enable clocks and configure GPIO */
  RCC->AHB1ENR |= (1 << 6) |        /* GPIO Port G clock enable */   
                  (1 << 5) |        /* GPIO Port F clock enable */ 
                  (1 << 4) |        /* GPIO Port E clock enable */ 
                  (1 << 3) |        /* GPIO Port D clock enable */
                  (1 << 1) |        /* GPIO Port B clock enable */
                  (1 << 0) ;        /* GPIO Port A clock enable */

  /* PD.0, 1, 3, 4, 5, 8, 9, 10, 11, 12, 14, 15 */
  GPIOD->MODER   &= ~0xF3FF0FCF;
  GPIOD->MODER   |=  0xA2AA0A8A;    /* Pins to alternate function    */  
  GPIOD->OTYPER  &= ~0x0000DF3B;    /* Configure as push-pull pins   */
  GPIOD->PUPDR   &= ~0xF3FF0FCF;
  GPIOD->PUPDR   |=  0x51550545;    /* Pull-ups on pins              */
  GPIOD->OSPEEDR |=  0xF3FF0FCF;    /* Pins output speed to 100MHz   */
  GPIOD->AFR[0]  &= ~0x00FFF0FF;
  GPIOD->AFR[0]  |=  0x00CCC0CC;
  GPIOD->AFR[1]  &= ~0xFF0FFFFF;
  GPIOD->AFR[1]  |=  0xCC0CCCCC;    /* Pins assigned to AF12 (FSMC)  */


  /* PE.7, 8, 9, 10, 11, 12, 13, 14, 15 */
  GPIOE->MODER   &= ~0xFFFFC000;
  GPIOE->MODER   |=  0xAAAA8000;    /* Pins to alternate function    */  
  GPIOE->OTYPER  &= ~0x0000FF80;    /* Configure as push-pull pins   */
  GPIOE->PUPDR   &= ~0xFFFFC000;
  GPIOE->PUPDR   |=  0x55554000;    /* Pull-ups on pins              */
  GPIOE->OSPEEDR |=  0xFFFFC000;    /* Pins output speed to 100MHz   */
  GPIOE->AFR[0]  &= ~0xF0000000;
  GPIOE->AFR[0]  |=  0xC0000000;
  GPIOE->AFR[1]   =  0xCCCCCCCC;    /* Pins assigned to AF12 (FSMC)  */


  /* PF.0, 1, 2, 3, 4, 5, 12, 13, 14, 15 */
  GPIOF->MODER   &= ~0xFF000FFF;
  GPIOF->MODER   |=  0xAA000AAA;    /* Pins to alternate function    */  
  GPIOF->OTYPER  &= ~0x0000F03F;    /* Configure as push-pull pins   */
  GPIOF->PUPDR   &= ~0xFF000FFF;
  GPIOF->PUPDR   |=  0x55000555;    /* Pull-ups on pins              */
  GPIOF->OSPEEDR |=  0xFF000FFF;    /* Pins output speed to 100MHz   */
  GPIOF->AFR[0]  &= ~0x00FFFFFF;
  GPIOF->AFR[0]  |=  0x00CCCCCC;
  GPIOF->AFR[1]  &= ~0xFFFF0000;
  GPIOF->AFR[1]  |=  0xCCCC0000;    /* Pins assigned to AF12 (FSMC)  */


  /* PG.0, 1, 2, 3, 4, 5 */
  GPIOG->MODER   &= ~0x00000FFF;
  GPIOG->MODER   |=  0x00000AAA;    /* Pins to alternate function    */  
  GPIOG->OTYPER  &= ~0x0000003F;    /* Configure as push-pull pins   */
  GPIOG->PUPDR   &= ~0x00000FFF;
  GPIOG->PUPDR   |=  0x00000555;    /* Pull-ups on pins              */
  GPIOG->OSPEEDR |=  0x00000FFF;    /* Pins output speed to 100MHz   */
  GPIOG->AFR[0]  &= ~0x00FFFFFF;
  GPIOG->AFR[0]  |=  0x00CCCCCC;    /* Pins assigned to AF12 (FSMC)  */

  
  switch (cs) {
    #ifdef FSMC_BANK1_CS1
    case FSMC_NE1: /* OneNAND */
      /* PD.7 = Chip Select (NE1), PD.6 = nWAIT */
      GPIOD->MODER   &= ~0x0000F000;
      GPIOD->MODER   |=  0x0000A000;    /* Pins to alternate function    */
      GPIOD->OTYPER  &= ~0x000000C0;    /* Configure as push-pull pins   */
      GPIOD->OSPEEDR |=  0x0000F000;    /* Pins output speed to 100MHz   */
      GPIOD->AFR[0]  &= ~0xFF000000;
      GPIOD->AFR[0]  |=  0xCC000000;    /* Pins assigned to AF12 (FSMC)  */
      
      /* PB.7 = NL (nAVD), PB.15 = OneNAND_INT */
      GPIOB->MODER   &= ~0xC000C000;
      GPIOB->MODER   |=  0x00008000;    /* PB.7 to alternate, PB.15 input */
      GPIOB->OTYPER  &= ~0x00000080;    /* PB.7 is push-pull              */
      GPIOB->PUPDR   &=  0xC000C000;
      GPIOB->PUPDR   |=  0x00004000;    /* PB.7 has pull-up               */
      GPIOB->OSPEEDR |=  0xC000C000;    /* Pins output speed to 100MHz    */
      GPIOB->AFR[0]  &= ~(0xFU << 28);
      GPIOB->AFR[0]  |=  (0xCU << 28);  /* PB.7 to AF12 (FSMC)            */
      GPIOB->AFR[1]  &= ~(0xFU << 28);  /* PB.15 to GPIO                  */
    
      /* CS 1 -> BCR 1 (Mode C Access - OneNAND) */
      FSMC_Bank1->BTCR[0] = (1 << 15) |    /* Async Wait                   */
                            (1 << 14) |    /* Extended mode enable         */
                            (1 << 12) |    /* Bank Write enable            */
                            (0 <<  9) |    /* Wait signal polarity (High)  */
                            (1 <<  6) |    /* Flash (NOR) access enable    */
                            (1 <<  4) |    /* Memory databus width         */
                            (2 <<  2) |    /* Memory type (NOR/OneNAND)    */
                            (1 <<  0) ;    /* Memory bank enable bit       */
      /* CS 1 -> BTR 1 */
      FSMC_Bank1->BTCR[1] = (0x02 << 28) | /* Access mode (C)              */
                            (0x00 << 24) | /* Data latency                 */
                            (0x00 << 20) | /* Clock divide ratio (CLK Sig) */
                            (0x0F << 16) | /* Bus turnaround phase duration*/
                            (0x0F <<  8) | /* Data phase duration          */
                            (0x0F <<  4) | /* Address hold  phase duration */ 
                            (0x01 <<  0) ; /* Address setup phase duration */
    
      /* CS 1 -> BWTR */
      FSMC_Bank1E->BWTR[0] =(0x02 << 28)| /* Access mode (C)              */
                            (0x00 << 24)| /* Data latency                 */
                            (0x00 << 20)| /* Clock divide ratio (CLK Sig) */
                            (0x0F << 16)| /* Bus turnaround phase duration*/
                            (0x0F << 8) | /* Data phase duration          */
                            (0x0F << 4) | /* Address hold  phase duration */ 
                            (0x01 << 0) ; /* Address setup phase duration */
      break;
    #endif
    /* case FSMC_NE2: */
    /* case FSMC_NE3: */
    /* case FSMC_NE4: */

    /* BANK 2 */
    /* case FSMC_NCE2: */

    /* BANK 3 */
    #ifdef FSMC_BANK3
    case FSMC_NCE3: /* NAND */
      /* PG9 = Chip Enable (NCE3) */
      GPIOG->MODER   &= ~GPIO_MODER_MODER9;
      GPIOG->MODER   |=  GPIO_MODER_MODER9_1; /* Pin to alternate function    */
      GPIOG->OTYPER  &= ~GPIO_OTYPER_OT_9;    /* Configure as push-pull pin   */
      GPIOG->OSPEEDR |=  GPIO_OSPEEDER_OSPEEDR9_0 |
                         GPIO_OSPEEDER_OSPEEDR9_1 ;  /* Pin speed is 100MHz   */
      GPIOG->AFR[1]  &= ~0x000000F0;
      GPIOG->AFR[1]  |=  0x000000C0;          /* Pin assigned to AF12 (FSMC)  */

