lizhiok/FPInterro/Libraries/MDK_LIB/RL/FlashFS/Drivers/NAND_STM32F2xx.c
      /* PD6 = Ready/Busy Input */
      GPIOD->MODER   &= ~GPIO_MODER_MODER6;
      GPIOD->MODER   |=  GPIO_MODER_MODER6_1; /* Pin to alternate function    */
      GPIOD->OTYPER  &= ~GPIO_OTYPER_OT_6;    /* Configure as push-pull pin   */
      GPIOD->OSPEEDR |=  GPIO_OSPEEDER_OSPEEDR6_0 |
                         GPIO_OSPEEDER_OSPEEDR6_1 ;  /* Pin speed is 100MHz   */
      GPIOG->AFR[0]  &= ~0x0F000000;
      GPIOG->AFR[0]  |=  0x0C000000;          /* Pin assigned to AF12 (FSMC)  */

      /* Configure ECC to 512 bytes */
      FSMC_Bank3->PCR3 = FSMC_PCR3_ECCPS_1 | /* ECC page size 512 bytes        */
                         FSMC_PCR3_TAR_0   | /* ALE to RE delay: x HCLK cycles */
                         FSMC_PCR3_TCLR_0  | /* CLE to RE delay: x HCLK cycles */
                         FSMC_PCR3_ECCEN   | /* ECC logic is enabled           */
                         FSMC_PCR3_PTYP    | /* Memory type is NAND Flash      */
                         FSMC_PCR3_PBKEN   ; /* Memory bank is enabled         */
      
      /* Configure common memory space timing */
      FSMC_Bank3->PMEM3 = NAND_CO_HIZ_TIME   |    /* Set HiZ time             */
                          NAND_CO_HOLD_TIME  |    /* Set hold time            */
                          NAND_CO_WAIT_TIME  |    /* Set wait time            */
                          NAND_CO_SETUP_TIME ;    /* Set setup time           */

      /* Configure attribute memory space timing */
      FSMC_Bank3->PATT3 = NAND_AT_HIZ_TIME   |    /* Set HiZ time             */
                          NAND_AT_HOLD_TIME  |    /* Set hold time            */
                          NAND_AT_WAIT_TIME  |    /* Set wait time            */
                          NAND_AT_SETUP_TIME ;    /* Set setup time           */
      break;
      #endif      

    /* BANK 4 */
    /* case FSMC_NCE4_1: */
    /* case FSMC_NCE4_2: */    
    default: return ERR_INVALID_PARAM;
  }
  return RTV_NOERR;
}


/*-----------------------------------------------------------------------------
 *      Flexible Static Memory Controler (FSMC) uninitialization
 *
 * cs = FSMC Chip Select (NOR/PSRAM, NAND, PC Card chip select)
 *
 *  Return: RTV_NOERR - UnInit successful
 *----------------------------------------------------------------------------*/
U32 FSMC_UnInit (U32 cs) {
  switch (cs) {
    #ifdef FSMC_BANK1_CS1
    case FSMC_NE1:
      /* Uninit PB15 and PD7 */
      GPIOB->MODER   &= ~0xC0000000;
      GPIOB->OTYPER  &= ~0x00008000;
      GPIOB->OSPEEDR &= ~0xC0000000;
      GPIOB->PUPDR   &= ~0xC0000000;
      GPIOB->AFR[1]  &= ~0xF0000000;

      GPIOD->MODER   &= ~0x0000C000;
      GPIOD->OTYPER  &= ~0x00000080;
      GPIOD->OSPEEDR &= ~0x0000C000;
      GPIOD->PUPDR   &= ~0x0000C000;
      GPIOD->AFR[0]  &= ~0xF0000000;
      
      /* FSMC Registers to reset values */
      FSMC_Bank1->BTCR[0]  = 0x0000305A;
      FSMC_Bank1->BTCR[1]  = 0x0FFFFFFF;
      FSMC_Bank1E->BWTR[0] = 0x0FFFFFFF; 
      break;
    #endif
    /* case FSMC_NE2: */
    /* case FSMC_NE3: */
    /* case FSMC_NE4: */

    /* BANK 2 */
    /* case FSMC_NCE2: */

    /* BANK 3 */
    #ifdef FSMC_BANK3
    case FSMC_NCE3:
      /* Uninit PG9 and PD6 */
      GPIOG->MODER   &= ~GPIO_MODER_MODER9;
      GPIOG->OTYPER  &= ~GPIO_OTYPER_OT_9;
      GPIOG->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR6;
      GPIOG->PUPDR   &= ~GPIO_PUPDR_PUPDR9;
      GPIOG->AFR[1]  &= ~0x000000F0;

      GPIOD->MODER   &= ~GPIO_MODER_MODER6;
      GPIOD->OTYPER  &= ~GPIO_OTYPER_OT_6;
      GPIOD->OSPEEDR &= ~GPIO_OSPEEDER_OSPEEDR6;
      GPIOD->PUPDR   &= ~GPIO_PUPDR_PUPDR6;
      GPIOD->AFR[0]  &= ~0x0F000000;

      /* FSMC Registers to reset values */
      FSMC_Bank3->PCR3  = 0x00000018;
      FSMC_Bank3->PMEM3 = 0xFCFCFCFC;
      FSMC_Bank3->PATT3 = 0xFCFCFCFC;
      break;
    #endif

    /* BANK 4 */
    /* case FSMC_NCE4_1: */
    /* case FSMC_NCE4_2: */
    default: return ERR_INVALID_PARAM;
  }
  return RTV_NOERR;
}


#ifdef FSMC_BANK1_CS1
/*-----------------------------------------------------------------------------
 *      Wait until OneNAND is busy (INT pin is low)
 *
 *  Return: __TRUE            - OneNAND Ready before timeout
 *          __FALSE           - OneNAND Busy, timeout expired
 *----------------------------------------------------------------------------*/
__inline static BOOL WaitINT (void) {
  U32 i;

  for (i = TIMEOUT_OneNAND; i; i--) {
#if 1 /* Pool on INT bit (Interrupt Status Register) */
    if (FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_INT) & (1 << 15)) {
      return __TRUE;
    }
#else /* Pool on INT pin (PB.15)  */
    if (GPIOB->IDR & (1 << 15)) {
      return __TRUE;
    }
#endif
  }
  return __FALSE;
}

/*-----------------------------------------------------------------------------
 *      Unlock Block in OneNAND Flash Array
 *
 * pbn = physical block number
 *
 *  Return: __TRUE            - OneNAND block unlocked before timeout
 *          __FALSE           - OneNAND Busy, timeout expired
 *----------------------------------------------------------------------------*/
static BOOL OneNAND_Unlock (U32 pbn) {
  /* Set block address */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_SBA) = (U16)pbn;
  
  /* Clear interrupt flags */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_INT) = 0x0000;

  /* Write unlock command */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_CMD) = ON_CMD_UNLOCK;
  
  /* Wait until operation complete */
  if (WaitINT() == __TRUE) {
    if (FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_WPS) == 0x0004) {
      return __TRUE;
    }
  }
  return __FALSE;
}


/*-----------------------------------------------------------------------------
 *      OneNAND initialization
 * Required page layout:
 * | Sect 0 | Sect 1 | Sect 2 | Sect 3 | Spare 0 | Spare 1 | Spare 2 | Spare 3 |
 *
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR        - Init successful
 *          ERR_NAND_HW_TOUT - Reset failed / NAND Unlock failed 
 *----------------------------------------------------------------------------*/
static U32 FSMC_OneNAND_Init (NAND_DRV_CFG *cfg) {
  U32 pbn;

  /* Setup OneNAND Page Layout */
  cfg->PgLay->Pos_LSN  = ON_POS_LSN;
  cfg->PgLay->Pos_COR  = ON_POS_COR;
  cfg->PgLay->Pos_BBM  = ON_POS_BBM;
  cfg->PgLay->Pos_ECC  = ON_POS_ECC;
  cfg->PgLay->SectInc  = ON_SECT_INC;
  cfg->PgLay->SpareOfs = ON_SPARE_OFS;
  cfg->PgLay->SpareInc = ON_SPARE_INC;
  
  /* Clear interrupts */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_INT) = 0x0000;

  /* Flash Hot Reset */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_CMD) = ON_CMD_RST_HOT;

