lizhiok/FPInterro/Libraries/MDK_LIB/RL/FlashFS/Drivers/NAND_STM32F2xx.c
  if (WaitINT() == __FALSE) {
    return ERR_NAND_HW_TOUT;
  }

  /* Set configuration */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_CFG_1) = (0 << 15) | /* Async mode */
                                                 (4 << 12) | /* Latency    */
                                                 (0 <<  9) | /* Burst Len  */
                                                 (0 <<  8) | /* ECC On     */
                                                 (1 <<  7) | /* Ready high */
                                                 (1 <<  6) | /* INT high   */
                                                 (1 <<  5) | /* IOB Enable */
                                                 (0 <<  4) ; /* Rdy 1clock */
  /* Check if controller ready */
  if (FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_STAT) != 0) {
    return ERR_NAND_HW_TOUT;
  }

  /* UnLock NAND Flash Array */
  for (pbn = 0; pbn < cfg->NumBlocks; pbn++) {
    if (OneNAND_Unlock (pbn) == __FALSE) {
      /* Block unlock failed */
      return ERR_NAND_HW_TOUT;
    }
  }
  return RTV_NOERR;
}


/*-----------------------------------------------------------------------------
 *      Read data from OneNAND
 *  row  = Page address
 *  *buf = Pointer to data buffer
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - Page read successful
 *          ERR_NAND_HW_TOUT  - Hardware transfer timeout
 *          ERR_ECC_COR       - ECC corrected the data within page
 *          ERR_ECC_UNCOR     - ECC was not able to correct the data
 *----------------------------------------------------------------------------*/
static U32 FSMC_OneNAND_Read (U32 row, U8 *buf, NAND_DRV_CFG *cfg) {
  U32 i, cnt, ba, dat, ecc;
  
  /* Set block and page address */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_SA_1) = (row / cfg->NumPages);
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_SA_8) = (row % cfg->NumPages)<<2;
  
  /* Set start buffer register: DataRAM0, 4 sectors */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_ST_BUF) = (U16)(8 << 8);

  /* Clear interrupt flags */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_INT) = 0x0000;

  /* Send load command */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_CMD) = ON_CMD_LDM_BUF;
  
  /* Wait until operation complete */
  if (WaitINT() == __FALSE) {
    return ERR_NAND_HW_TOUT;
  }

  /* Read user data from DATARAM0 buffer */
  cnt = (cfg->PageSize/512) * 512;
  for (ba = ON_DBUF_ADDR, i = 0; i < cnt; i += 2, ba += 2) {
    dat = FSMC_AHB_W16 (FSMC_BANK1_BASE, ba);
    buf[i]   = (U8)dat;
    buf[i+1] = (U8)(dat >> 8);
  }
  
  /* Read spare area data from DataRAM0 buffer */
  cnt += (cfg->PageSize/512) * 16;
  for (ba = ON_SBUF_ADDR; i < cnt; i += 2, ba += 2) {
    dat = FSMC_AHB_W16 (FSMC_BANK1_BASE, ba);
    buf[i]   = (U8)dat;
    buf[i+1] = (U8)(dat >> 8);
  }

  /* Read ECC status */
  ecc = FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_ECC_ST);
  if (ecc & 0xAAAA) {
    return ERR_ECC_UNCOR;
  }
  if (ecc & 0x5555) {
    return ERR_ECC_COR;
  }
  
  return RTV_NOERR;
}


/*-----------------------------------------------------------------------------
 *      Write data to OneNAND
 *  row  = Page address
 *  *buf = Pointer to data to write
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - Buffer written successfuly
 *          ERR_NAND_PROG     - Programing failed
 *          ERR_NAND_HW_TOUT  - Hardware request timeout
 *----------------------------------------------------------------------------*/
static U32 FSMC_OneNAND_Write (U32 row, U8 *buf, NAND_DRV_CFG *cfg) {
  U16 dat;
  U32 i, cnt, ba;

  /* Copy user data to DataRAM0 buffer */
  ba  = ON_DBUF_ADDR;
  cnt = cfg->SectorsPerPage * 512;
  for (i = 0; i < cnt; i += 2) {
    dat = (U16)(buf[i+1] << 8) | (U16)buf[i];
    FSMC_AHB_W16 (FSMC_BANK1_BASE, ba) = dat;
    ba += 2;
  }

  /* Copy spare area data to DataRAM0 buffer */
  ba = ON_SBUF_ADDR;
  cnt += cfg->SectorsPerPage * 16;
  for (; i < cnt; i += 2) {
    dat = (U16)(buf[i+1] << 8) | (U16)buf[i];
    FSMC_AHB_W16 (FSMC_BANK1_BASE, ba) = dat;
    ba += 2;
  }

  /* Set block and page address */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_SA_1) = (row / cfg->NumPages);
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_SA_8) = (row % cfg->NumPages)<<2;
  
  /* Set start buffer register: DataRAM0, 4 sectors */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_ST_BUF) = (U16)(8 << 8);

  /* Clear interrupt flags */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_INT) = 0x0000;

  /* Send program command */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_CMD) = ON_CMD_PRG_BUF;

  /* Wait until operation complete */
  if (WaitINT() == __FALSE) {
    return ERR_NAND_HW_TOUT;
  }

  /* Read status */
  if (FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_STAT) & ON_FL_PROG) {
    /* Programing failed */
    return ERR_NAND_PROG;
  }

  return RTV_NOERR;
}


/*-----------------------------------------------------------------------------
 *      Erase block of memory on NOR/SRAM
 *  row  = Block address
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR        - Erase operation successful
 *          ERR_NAND_ERASE   - Erase operation failed
 *          ERR_NAND_HW_TOUT - Hardware request timeout
 *----------------------------------------------------------------------------*/
static U32 FSMC_OneNAND_Erase (U32 row, NAND_DRV_CFG *cfg) {
  U32 fba;

  /* Write block address */
  fba = row / cfg->NumPages;
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_SA_1) = (U16)fba;
    
  /* Write 0 to interrupt register */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_INT) = (U16)0x0000;

  /* Write erase command */
  FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_CMD) = ON_CMD_ERASE;

  /* Wait until operation complete */
  if (WaitINT() == __FALSE) {
    return ERR_NAND_HW_TOUT;
  }

  /* Read status */
  if (FSMC_AHB_W16 (FSMC_BANK1_BASE, ON_REG_STAT) & ON_FL_ERASE) {
    /* Erase failed */
    return ERR_NAND_ERASE;
  }
  
  return RTV_NOERR;
}
#endif


#ifdef FSMC_BANK3
/*-----------------------------------------------------------------------------
        Write command
 *----------------------------------------------------------------------------*/
__inline static void NAND_WrCmd (U32 cmd) {
  NAND_CMD_W8 = (U8)cmd;
}


/*-----------------------------------------------------------------------------
        Set page address
 *----------------------------------------------------------------------------*/
static void NAND_SetPgAddr (U32 numCyc, U32 row, U32 pgSz) {  
  U32 i;

  NAND_ADR_W8 = 0;
  numCyc--;
  if (pgSz > 528) {    
    NAND_ADR_W8 = 0;
    numCyc--;
  }

  i = 0;
  while (numCyc--) {
    NAND_ADR_W8 = (U8)(row >> i);
    i += 8;
  }
}


/*-----------------------------------------------------------------------------
        Set block address
 *----------------------------------------------------------------------------*/
__inline void NAND_SetBlAddr (U32 numCyc, U32 row, U32 pgSz) {
  U32 i;

  numCyc = (pgSz > 528) ? (numCyc - 2) : (numCyc - 1);

  i = 0;
  while (numCyc--) {
    NAND_ADR_W8 = (U8)(row >> i);
    i += 8;
  }
}


/*-----------------------------------------------------------------------------
 *      Wait until NAND is busy (Ready bit in status register is 0)
 *
 *  Return: __TRUE            - NAND Ready before timeout
 *          __FALSE           - NAND Busy, timeout expired
 *----------------------------------------------------------------------------*/
__inline static BOOL NAND_WaitReady (void) {
  U32 i;

  for (i = NAND_TIMEOUT; i; i--) {
    /* Read Status Register */
    NAND_CMD_W8 = NAND_CMD_STATUS;
    if (NAND_DATA_W8 & NAND_STAT_RDY) {
      return (__TRUE);
    }
  }
  return (__FALSE);
}


/*-----------------------------------------------------------------------------
        Check status register if specified flag is set

  flag = NAND status flag

  Return: NAND_FLAG_SET  - NAND flag is set
          NAND_FLAG_CLR  - NAND flag is cleared
 *----------------------------------------------------------------------------*/
__inline static U32 NAND_ChkStatus (U32 flag) {

