lizhiok/FPInterro/Libraries/MDK_LIB/RL/FlashFS/Drivers/NAND_STM32F2xx.c
  NAND_CMD_W8 = NAND_CMD_STATUS;  
  return (NAND_DATA_W8 & flag) ? NAND_FLAG_SET : NAND_FLAG_CLR; 
}


/*-----------------------------------------------------------------------------
 *      NAND initialization
 * Default page layout is used.
 *
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR        - Init successful
 *          ERR_NAND_HW_TOUT - Reset failed / NAND Unlock failed 
 *----------------------------------------------------------------------------*/
static U32 FSMC_NAND_Init (NAND_DRV_CFG *cfg) {  
  
  /* Reset NAND chip */
  NAND_WrCmd (NAND_CMD_RESET);

  /* Wait until ready */
  if (NAND_WaitReady() == __FALSE) {
    /* Reset failed */
    return ERR_NAND_HW_TOUT;
  }
  
  /* NAND is ready */
  return RTV_NOERR;
}


/*-----------------------------------------------------------------------------
 *      Read data from NAND
 *  row  = Page address
 *  *buf = Pointer to data buffer
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - Page read successful
 *          ERR_NAND_HW_TOUT  - Hardware transfer timeout
 *          ERR_ECC_COR       - ECC corrected the data within page
 *          ERR_ECC_UNCOR     - ECC was not able to correct the data
 *----------------------------------------------------------------------------*/
static U32 FSMC_NAND_Read (U32 row, U8 *buf, NAND_DRV_CFG *cfg) {
  U32 i, sz;

  /* Write command 1 */
  NAND_WrCmd (NAND_CMD_READ1ST);

  /* Set address */
  NAND_SetPgAddr (cfg->AddrCycles, row, cfg->PageSize);

  /* Write command 2 */
  NAND_WrCmd (NAND_CMD_READ2ND);

  /* Wait until NAND ready */
  if (NAND_WaitReady() == __FALSE) {
    return ERR_NAND_HW_TOUT;
  }

  /* Switch back to read: Write command 1 */
  NAND_WrCmd (NAND_CMD_READ1ST);

  /* Read page from NAND chip */
  sz = cfg->PageSize;
  for (i = 0; i < sz; i += 8) {
    buf[i]   = NAND_DATA_W8;
    buf[i+1] = NAND_DATA_W8;
    buf[i+2] = NAND_DATA_W8;
    buf[i+3] = NAND_DATA_W8;
    buf[i+4] = NAND_DATA_W8;
    buf[i+5] = NAND_DATA_W8;
    buf[i+6] = NAND_DATA_W8;
    buf[i+7] = NAND_DATA_W8;
  }

  return RTV_NOERR;
}


/*-----------------------------------------------------------------------------
 *      Write data to NAND
 *  row  = Page address
 *  *buf = Pointer to data to write
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - Buffer written successfuly
 *          ERR_NAND_PROG     - Programing failed
 *          ERR_NAND_HW_TOUT  - Hardware request timeout
 *----------------------------------------------------------------------------*/
static U32 FSMC_NAND_Write (U32 row, U8 *buf, NAND_DRV_CFG *cfg) {
  U32 i, sz;

  /* Write command 1 */
  NAND_WrCmd (NAND_CMD_PROG1ST);

  /* Set address */
  NAND_SetPgAddr (cfg->AddrCycles, row, cfg->PageSize);
  
  /* Write data to NAND chip */
  sz = cfg->PageSize;
  for (i = 0; i < sz; i += 8) {
    NAND_DATA_W8 = buf[i];
    NAND_DATA_W8 = buf[i+1];
    NAND_DATA_W8 = buf[i+2];
    NAND_DATA_W8 = buf[i+3];
    NAND_DATA_W8 = buf[i+4];
    NAND_DATA_W8 = buf[i+5];
    NAND_DATA_W8 = buf[i+6];
    NAND_DATA_W8 = buf[i+7];
  }

  /* Write command 2 */
  NAND_WrCmd (NAND_CMD_PROG2ND);

  /* Wait until NAND ready */
  if (NAND_WaitReady() == __FALSE) {
    return ERR_NAND_HW_TOUT;
  }

  /* Check status */
  switch (NAND_ChkStatus (NAND_STAT_FAIL)) {
    case NAND_FLAG_TOUT:
      return ERR_NAND_HW_TOUT;
    case NAND_FLAG_SET:
      return ERR_NAND_PROG;
    default:
      return RTV_NOERR;
  }
}

/*-----------------------------------------------------------------------------
 *      Erase block of memory on NAND
 *  row  = Block address
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR        - Erase operation successful
 *          ERR_NAND_ERASE   - Erase operation failed
 *          ERR_NAND_HW_TOUT - Hardware request timeout
 *----------------------------------------------------------------------------*/
static U32 FSMC_NAND_Erase (U32 row, NAND_DRV_CFG *cfg) {
  /* Write command 1 */
  NAND_WrCmd (NAND_CMD_ERASE1ST);
  
  /* Set address */
  NAND_SetBlAddr (cfg->AddrCycles, row, cfg->PageSize);
  
  /* Write command 2 */
  NAND_WrCmd (NAND_CMD_ERASE2ND);

  /* Wait until NAND ready */
  if (NAND_WaitReady() == __FALSE) {
    return ERR_NAND_HW_TOUT;
  }
  
  /* Check status */
  switch (NAND_ChkStatus (NAND_STAT_FAIL)) {
    case NAND_FLAG_TOUT:
      return ERR_NAND_HW_TOUT;
    case NAND_FLAG_SET:
      return ERR_NAND_ERASE;
    default:
      return RTV_NOERR;
  }
}
#endif

/*-----------------------------------------------------------------------------
 *      Select Chip Select
 *  DrvInst = Instance Number
 *----------------------------------------------------------------------------*/
static U32 SetCs (U32 DrvInst) {
  if (DrvInst == 0) {
    #ifdef FSMC_BANK1_CS1
    return FSMC_NE1;                                   /* Select OneNand      */
    #endif
    
    #ifdef FSMC_BANK3
    return FSMC_NCE3;                                  /* Select NAND Flash   */
    #endif  
  }
  else {
    return FSMC_CS_INV;                                /* Invalid Chip Select */ 
  }
}


/*-----------------------------------------------------------------------------
 *      Initialise NAND flash driver
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - NAND Flash Initialisation successful
 *          ERR_NAND_HW_TOUT  - NAND Flash Reset Command failed
 *          ERR_INVALID_PARAM - Invalid parameter
 *----------------------------------------------------------------------------*/
static U32 Init (NAND_DRV_CFG *cfg) {
  U32 cs;

  /* Determine Chip Select from instance number */
  cs = SetCs (cfg->DrvInst);

  switch (cs) {
    /* BANK 1 */
    #ifdef FSMC_BANK1_CS1
    case FSMC_NE1:
      FSMC_Init(FSMC_NE1);                              /* Init FSMC Bank 1_1 */
      return FSMC_OneNAND_Init (cfg);                   /* Init OneNAND       */
    #endif
    /* case FSMC_NE2: */
    /* case FSMC_NE3: */
    /* case FSMC_NE4: */

    /* BANK 2 */
    /* case FSMC_NCE2: */

    /* BANK 3 */
    #ifdef FSMC_BANK3
    case FSMC_NCE3:                                     
      FSMC_Init (FSMC_NCE3);                            /* Init FSMC Bank 3   */
      return FSMC_NAND_Init (cfg);                      /* Init NAND Flash    */   
    #endif

    /* BANK 4 */
    /* case FSMC_NCE4_1: */
    /* case FSMC_NCE4_2: */
    default: return ERR_INVALID_PARAM;
  }
}

/*-----------------------------------------------------------------------------
 *      Uninitialise NAND flash driver
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - UnInit successful
 *----------------------------------------------------------------------------*/
static U32 UnInit (NAND_DRV_CFG *cfg) {
  U32 cs;

  /* Determine Chip Select from instance number */
  cs = SetCs (cfg->DrvInst);

  switch (cs) {
    /* BANK 1 */
    #ifdef FSMC_BANK1_CS1
    case FSMC_NE1:  return FSMC_UnInit (FSMC_NE1);
    #endif
    /* case FSMC_NE2: */
    /* case FSMC_NE3: */
    /* case FSMC_NE4: */

    /* BANK 2 */
    /* case FSMC_NCE2: */

    /* BANK 3 */
    #ifdef FSMC_BANK3
    case FSMC_NCE3: return FSMC_UnInit (FSMC_NCE3);
    #endif

    /* BANK 4 */
    /* case FSMC_NCE4_1: */
    /* case FSMC_NCE4_2: */
    default:        return ERR_INVALID_PARAM;
  }
}

/*-----------------------------------------------------------------------------
 *      Read page
 *  row  = Page address
 *  *buf = Pointer to data buffer
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - Page read successful
 *          ERR_NAND_HW_TOUT  - Hardware transfer timeout
 *          ERR_ECC_COR       - ECC corrected the data within page
 *          ERR_ECC_UNCOR     - ECC was not able to correct the data
 *----------------------------------------------------------------------------*/
static U32 PageRead (U32 row, U8 *buf, NAND_DRV_CFG *cfg) {
  U32 cs;

  /* Determine Chip Select from instance number */
  cs = SetCs (cfg->DrvInst);

  switch (cs) {
    /* BANK 1 */
    #ifdef FSMC_BANK1_CS1
    case FSMC_NE1:  return FSMC_OneNAND_Read (row, buf, cfg);
    #endif
    /* case FSMC_NE2: */
    /* case FSMC_NE3: */
    /* case FSMC_NE4: */

    /* BANK 2 */
    /* case FSMC_NCE2: */

    /* BANK 3 */
    #ifdef FSMC_BANK3
    case FSMC_NCE3: return FSMC_NAND_Read (row, buf, cfg);
    #endif

    /* BANK 4 */
    /* case FSMC_NCE4_1: */
    /* case FSMC_NCE4_2: */
    default: return ERR_INVALID_PARAM;
  }
}

/*-----------------------------------------------------------------------------
 *      Write page
 *  row  = Page address
 *  *buf = Pointer to data buffer
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - Page write successful
 *          ERR_NAND_PROG     - Page write failed
 *          ERR_NAND_HW_TOUT  - Hardware transfer timeout
 *----------------------------------------------------------------------------*/
static U32 PageWrite (U32 row, U8 *buf, NAND_DRV_CFG *cfg) {
  U32 cs;

  /* Determine Chip Select from instance number */
  cs = SetCs (cfg->DrvInst);

  switch (cs) {
    /* BANK 1 */
    #ifdef FSMC_BANK1_CS1
    case FSMC_NE1:  return FSMC_OneNAND_Write (row, buf, cfg);
    #endif
    /* case FSMC_NE2: */
    /* case FSMC_NE3: */
    /* case FSMC_NE4: */

    /* BANK 2 */
    /* case FSMC_NCE2: */

    /* BANK 3 */
    #ifdef FSMC_BANK3
    case FSMC_NCE3: return FSMC_NAND_Write (row, buf, cfg);
    #endif

    /* BANK 4 */
    /* case FSMC_NCE4_1: */
    /* case FSMC_NCE4_2: */
    default: return ERR_INVALID_PARAM;
  }
}

/*-----------------------------------------------------------------------------
 *      Erase block
 *  row  = Block address
 *  *cfg = Pointer to configuration structure
 *
 *  Return: RTV_NOERR         - Block erase successful
 *          ERR_NAND_ERASE    - Block erase failed
 *          ERR_NAND_HW_TOUT  - Hardware transfer timeout
 *----------------------------------------------------------------------------*/
static U32 BlockErase (U32 row, NAND_DRV_CFG *cfg) {
  U32 cs;

  /* Determine Chip Select from instance number */
  cs = SetCs (cfg->DrvInst);
  
  switch (cs) {
    /* BANK 1 */
    #ifdef FSMC_BANK1_CS1
    case FSMC_NE1:  return FSMC_OneNAND_Erase (row, cfg);
    #endif
    /* case FSMC_NE2: */
    /* case FSMC_NE3: */
    /* case FSMC_NE4: */

    /* BANK 2 */
    /* case FSMC_NCE2: */

    /* BANK 3 */
    #ifdef FSMC_BANK3
    case FSMC_NCE3: return FSMC_NAND_Erase (row, cfg);
    #endif

    /* BANK 4 */
    /* case FSMC_NCE4_1: */
    /* case FSMC_NCE4_2: */
    default: return ERR_INVALID_PARAM;
  }
}

/*-----------------------------------------------------------------------------
 * end of file
 *----------------------------------------------------------------------------*/
